{ "data" : [ {"title":"so seems like this particular piece has 30% less capacity than the ...","review":"Bought this product from Cloudtail India during one of the Amazon sales.What comes in the box:10400mAh Powerbank, Charging cable, instruction manual.Charging:I have an phone with a battery capacity of approx 3000 mAh and the power bank gives me about 2-2.5 charges... so seems like this particular piece has 30% less capacity than the 10400 mAh.Size & Weight:I have to say that this product is larger than i thought it would be when i bought it. It is about 5.5 inches long - which is about the size of a pen, 2 inches tall and 1 inch high.This being said, it is pretty light and can easily be carried around in your bag but probably would not fit in your pocket.Overall, i think that for many people a battery pack with a single charge might be easier to carry around and do the trick of getting your phone through the entire day... but if you are constantly on the move or need the exrta capacity, this would be a great bet.","rating":"4.0","score":3,"comparative":0.01639344262295082,"effective":0.06557377049180328,"wordLength":5},{"title":"Good Performance","review":"It has been two months that I brought this power bank & I have to say that this powerbank is working very much good. Its very decent looking power bank. I have the black colour variant of it and its very easy to use it. The device comes with 2 USB ports for charging having an output current of 2.1 A and an output voltage of 5 V. Its very hand and easy to use. One intresting feature of the powerbank which i like is that when you plug your device its automatically starts charging the device without you needed to switch it on. It has a decent looking battery indicator . And all of the above this device comes from a well reputed company so its really value for you money. So thumbs up to this power bank and I would suggest you to buy this since its very good in performance but also at the same time its affordable too..","rating":"5.0","score":12,"comparative":0.06857142857142857,"effective":0.34285714285714286,"wordLength":6},{"title":"Not a good one","review":"I thought Lenovo is a good brand, but thinking is not always right.Reviewing it after use of 1 year.Battery is the most Important thing as it is shown it's of 10400 mah power, but its actually capacity is 5k-5.5k,Looks like a duplicate one,Maybe amazon has cheated,After using ut for a 1 year its capacity had decreased to abt. 4k mah..So buy intex or syska at the place of this lenovo... Otherwise its everyone's own thinking.. all the best ha, coz if u gonna buy it then u would need a good ATB.","rating":"1.0","score":15,"comparative":0.14285714285714285,"effective":0.14285714285714285,"wordLength":6},{"title":"Duplicate Product in the brand of Lenovo.","review":"In the name of Lenovo brand this is a duplicate product. This is fooling of customer form Amazon.Just after couple of weeks, this product is useless. It takes hour n hours to get charged and after full charge also it hardly charge the mobile one time.This is just ridiculous and I am very much annoyed by it. I was out of station and now I can not return this product also having amazon's ten days policy. Amazon should refund\\accept return of this product.","rating":"1.0","score":-10,"comparative":-0.10416666666666667,"effective":-0.10416666666666667,"wordLength":4},{"title":"Build quality is really good at this price point and considering the grand name","review":"Build quality is really good at this price point and considering the grand name. The length of the USB provided is nearly useless. Powerbank takes almost 6 hours to charge up completely. I am quite disappointed when I found out that my mobile (2600mAH) could be charged just thrice and the capacity promised by the power bank is of 10400.","rating":"3.0","score":2,"comparative":0.0273972602739726,"effective":0.0821917808219178,"wordLength":7},{"title":"One thing more i'd like to share with u people dont charge powerbanks with ...","review":"Gud backup approx 9000mah plus,Very light weight product,Only thing is no led flashlight inbuilt, but its a powerbank nt a light utility.So 5star for backup purpose.One thing more i'd like to share with u people dont charge powerbanks with 2amp or 4 amp chargers, use slow chargers theyll give more backups in return👍👍👍","rating":"5.0","score":2,"comparative":0.030303030303030304,"effective":0.15151515151515152,"wordLength":3},{"title":"I hate this - useless : stopped working in 2 months.","review":"HiI purchased the Lenovo Power bank on 1st June 2015 : pretty expensive viz a viz other power banks. I started to make use of the same around October 2015 and it has stopped working.This is soooo depressing and dejection for Lenovo.I hate this product and suggest noone should ever buy this.Replacement also not possible.","rating":"1.0","score":-5,"comparative":-0.07352941176470588,"effective":-0.07352941176470588,"wordLength":4},{"title":"Good one must buy","review":"This one can charge my Lumia 720 3.5 times from fully drained battery power. But to charge this powerbank it takes more than 6 hrs which is not a big deal. You could use a higher amp charger to charge it faster. It could have come up with a charging cord. Yes it gets dirty fast. I even bought another one for my mom.","rating":"4.0","score":-2,"comparative":-0.025974025974025976,"effective":-0.1038961038961039,"wordLength":4},{"title":"Power bank charging does not get completed.","review":"Even after keeping the power bank for charging for 24 hours, the charging does not end, and the fourth step light keeps blinking. So its not getting charged fully. I guess the inside batteries may be from old stock with expired life. May be the reason for heavy discount.Initiated return of the product.","rating":"1.0","score":-3,"comparative":-0.045454545454545456,"effective":-0.045454545454545456,"wordLength":1},{"title":"Lenovo Power Bank - Not getting charged ! Bad Experience !","review":"After unpacking Lenove Power Bank , I put the unit on charging . Even after 24 hours it doesn't get itself charged . Product failure or faulty unit that is Lenovo and supplier to decide. But for me it's  bad experience with Lenovo product . Hope they wil replace the faulty unit under warranty .","rating":"1.0","score":-6,"comparative":-0.08695652173913043,"effective":-0.08695652173913043,"wordLength":4},{"title":"Lost it, that's why I don't like it","review":"Lol. As far as getting the job done is concerned, this is a nice product and charges my phone at least twice before dying out. However, the casing is prone to visible scratches making it look ugly and dirty easily, if possible, get a different colour","rating":"1.0","score":-6,"comparative":-0.1016949152542373,"effective":-0.1016949152542373,"wordLength":7},{"title":"Waste of Money","review":"Don't go for this product... my galaxy note 3 having 3100 mah battery which is charged once & powerbank battery drain out in one charge eventhough it's fully charged... problem started exactly finishing 10 days return policy as per sellers terms.","rating":"1.0","score":-8,"comparative":-0.14814814814814814,"effective":-0.14814814814814814,"wordLength":3},{"title":"Short life","review":"Writing review after 11 months of uses.Now after 11 months the backup of this power bank has drastically reduced. Right now it's almost having 50% of the strength as compared to the day one. It seems it may not work more than 2 months from now.","rating":"3.0","score":2,"comparative":0.03389830508474576,"effective":0.1016949152542373,"wordLength":1},{"title":"Horrible Quality- Never Buy","review":"This product couldn't even survive for a week and one of the USB port came out from board. I requested Amazon for the replacement before but they didnt initiate anything. Will never recommend anyone else to buy this ugly product.","rating":"1.0","score":-1,"comparative":-0.018867924528301886,"effective":-0.018867924528301886,"wordLength":2},{"title":"Good for travelling","review":"It is very cool in charging in 50 to 60 minutes it is hardly take to charge a big to big battery and it usually takes also 1 hour to charge this power bank but I'm giving it four star because of its size it is usually big","rating":"4.0","score":4,"comparative":0.06557377049180328,"effective":0.26229508196721313,"wordLength":4},{"title":"Drains out faster than expected","review":"After a full charge (about 2 hrs), if i charge a mobile phone, the power bank  goes down to two bars within 30 mins. Also its a lot bulky than expected and not an easy one to carry in ones pocket or even a ladies pursue.","rating":"2.0","score":1,"comparative":0.016666666666666666,"effective":0.03333333333333333,"wordLength":1},{"title":"After using lenovo powerbank 10400mah for 1 month","review":"After using this powerbank for 1 month.Lenovo powerbank is not giving full 10400mah performance. My mobile battery is 1800mah. Powerbank gets discharged fully after 3 times charging. Plus point is it is cheap that's it.","rating":"3.0","score":0,"comparative":0,"effective":0,"wordLength":0},{"title":"Feeling cheated by amazon by lenovo.","review":"Specification shows 10400 mh power bank whereas truth is that it can't charge my Samsung j8 once... Means power bank capacity is not capable enough to charge j8 once.. So don buy this power bank they are cheating us.","rating":"1.0","score":-4,"comparative":-0.07692307692307693,"effective":-0.07692307692307693,"wordLength":2},{"title":"Worth for money","review":"I got it from amazon @ 519 RS. My family members are  using the same product from long time so I ordered it for myself.... After the use, I am reviewing it.... It is good for ur mobile charging n can trust lenovo.","rating":"5.0","score":4,"comparative":0.07017543859649122,"effective":0.3508771929824561,"wordLength":2},{"title":"Money waste","review":"Very bod quality. Need to charge 12 or 14 hours for full charge and i can charge my Lenovo K4 note only once.Money Waste !I want to return this.Having i year warranty. I want to return this item. Pls cooperate.","rating":"1.0","score":3,"comparative":0.05660377358490566,"effective":0.05660377358490566,"wordLength":4},{"title":"Not satisfied with the charging ability","review":"Not satisfied with the charging ability. Only able to charge my Lenovo K5 Note one time. As per claimed mAh of the power bank, it should be able to charge atleast twice without an issue. 3 star for the product.","rating":"3.0","score":0,"comparative":0,"effective":0,"wordLength":2},{"title":"Fake Battery Capacity","review":"i don't like the battery capacity of this power bank, when i charged it full it will charge my phone approx one and half time, where my battery capacity is 3500 mAh, also the 1 charging port is not working.","rating":"2.0","score":-5,"comparative":-0.09433962264150944,"effective":-0.18867924528301888,"wordLength":2},{"title":"Pl do not buy","review":"Does not even complete a second charge for a 3000 maH battery phone.Takes long time to recharge itself and also while charging the phone.I had bought it because of the brand but I regret that.","rating":"1.0","score":-2,"comparative":-0.041666666666666664,"effective":-0.041666666666666664,"wordLength":1},{"title":"Awesome!","review":"It is really un comparable with other powerbanks. It is been more than a year and i have still no issues also it really does charge fast even though it doesnt have fast charge compatibility","rating":"5.0","score":-1,"comparative":-0.020833333333333332,"effective":-0.10416666666666666,"wordLength":1},{"title":"Working good","review":"I have been using it for some time now and I must say that the product is good. It used to do 3 full charge of my Moto g3. Now, I am using oneplus two, and 2 full charge is assured.","rating":"5.0","score":3,"comparative":0.05555555555555555,"effective":0.2777777777777778,"wordLength":1},{"title":"Posting this comment after using it for year n half","review":"Exactly as shown and battery backup is good . I'm posting this comment after using it for a year n half . Charging process is fast and can full charge 3-4 mobile's in a day easily.","rating":"5.0","score":3,"comparative":0.061224489795918366,"effective":0.30612244897959184,"wordLength":1},{"title":"A Great product!","review":"Genuine Product from a genuine manufacturer.It comes with a small USB type B charging cable, useful for charging compatible phones.Only downside is that it's quite heavy.","rating":"4.0","score":0,"comparative":0,"effective":0,"wordLength":2},{"title":"so its useless for me now","review":"i have purchased may.2016..its not working now.not able to find customer care number.service center is 150 KM far from where i lived..so its useless for me now...","rating":"1.0","score":0,"comparative":0,"effective":0,"wordLength":2},{"title":"Very very good","review":"Awesome purchase ,fully satisfy ,battery back up is quite Awesome,in single charge I charged my mobile twice and also charged samsung level u  bluetooth headset ,","rating":"5.0","score":-2,"comparative":-0.05,"effective":-0.25,"wordLength":3},{"title":"Worst product","review":"Very Bad Power Bank . My Two laptop got damaged due to the same as be,coz I have connected the power bank to my laptop for charge the Power Bank. Worst product","rating":"1.0","score":-9,"comparative":-0.2,"effective":-0.2,"wordLength":3},{"title":"Have been using it since 4 months now and the performance is good. It charges my Oneplus 3T twice","review":"I had purchased this powerbank bcoz i keep traveling a lot. Have been using it since 4 months now and the performance is good. It charges my Oneplus 3T twice.","rating":"5.0","score":1,"comparative":0.023255813953488372,"effective":0.11627906976744186,"wordLength":2},{"title":"Very good product","review":"Its been over one and hald year since I bought it. It is the first powerbank which is so durable and I am drwwuantly using it. Nice one and worth the pricem","rating":"5.0","score":7,"comparative":0.15555555555555556,"effective":0.7777777777777778,"wordLength":3},{"title":"Not fully satisfied","review":"Working fine. But can charge iphone new battery only 1.5 times. Should have charged 3 times as expected as iPhone 7 plus battery capacity is 2900 mAh.","rating":"3.0","score":-1,"comparative":-0.025,"effective":-0.07500000000000001,"wordLength":2},{"title":"Four Stars","review":"bulky and brick like. rest it is as described.dead in 4 monthsdidnt charged twice even in first timedont buy guys not even if they offer money with it","rating":"1.0","score":-1,"comparative":-0.024390243902439025,"effective":-0.024390243902439025,"wordLength":2},{"title":"Must buy one","review":"I already purchased 13000 mah power bank. This is my second one for my family.. its really awesome last long. Charge mobile fast and easy.","rating":"4.0","score":5,"comparative":0.13157894736842105,"effective":0.5263157894736842,"wordLength":2},{"title":"Usee it n buy it","review":"Its just superb n the charging n lyf of the battery atleast remains for 4 days its good as per compared to other powerbankS","rating":"5.0","score":8,"comparative":0.21621621621621623,"effective":1.0810810810810811,"wordLength":2},{"title":"Huawei honor 13000 mah power bank can charge my phone ...","review":"Huawei  honor 13000 mah power bank can charge my phone 4 rounds straight..... this one struggles for 2 complete charges.","rating":"3.0","score":-1,"comparative":-0.029411764705882353,"effective":-0.08823529411764705,"wordLength":4},{"title":"The Intex battery bank of equivalent capacity was a much better performer.","review":"Very heavy and doesn't hold charge for long. The Intex battery bank of equivalent capacity was a much better performer.","rating":"2.0","score":2,"comparative":0.06060606060606061,"effective":0.12121212121212122,"wordLength":1},{"title":"Lenovo power banks","review":"Lenovo name is enough. It is a product that very high quality. I am very very happy with this product. Thanks amazon.","rating":"5.0","score":7,"comparative":0.2,"effective":1,"wordLength":3},{"title":"Good","review":"Decent for usage,Only problem isTakes more time in charging 15 to 20hrs,Can be used 2_3 times after full charge","rating":"4.0","score":-2,"comparative":-0.0625,"effective":-0.25,"wordLength":1},{"title":"Good power bank","review":"Good battery backup it charges my 1 pad 2 times and my iphone 3 times but it takes time to get fully charged","rating":"4.0","score":-2,"comparative":-0.05555555555555555,"effective":-0.2222222222222222,"wordLength":3},{"title":"Only 2 Times charge my phone","review":"my mobile have 4000mah battery and while power bank are full charge than 2 time mobile will charge.","rating":"2.0","score":0,"comparative":0,"effective":0,"wordLength":0},{"title":"100% Buy","review":"Nice battery backup after 1st charge. It can charge my phone 2times 3800mah 2 times full charge.","rating":"5.0","score":3,"comparative":0.1,"effective":0.5,"wordLength":1},{"title":"10400mah... it's good","review":"This product is good and has good capacity.I am using it from 3months it's good and perfect","rating":"5.0","score":12,"comparative":0.4,"effective":2,"wordLength":4},{"title":"Ugly","review":"Ugly cheap plastic look. Fatter than its counterparts of the same price and performance.","rating":"2.0","score":-3,"comparative":-0.1111111111111111,"effective":-0.2222222222222222,"wordLength":1},{"title":"Value for money.","review":"Charging the power bank is very slow despite charge on 5V, 2Amp charging adaptor","rating":"3.0","score":0,"comparative":0,"effective":0,"wordLength":0},{"title":"... my phone since a year and its been so good till now","review":"charging my phone since a year and its been so good till now. thank u amazon.","rating":"5.0","score":5,"comparative":0.1724137931034483,"effective":0.8620689655172414,"wordLength":2},{"title":"One Star","review":"Very poor quality only last for 2 hours I am very unhappy with the product","rating":"1.0","score":-2,"comparative":-0.07142857142857142,"effective":-0.07142857142857142,"wordLength":3},{"title":"A full charge works good for 3-4 days.","review":"havent seen any faults yet so happy with the product .","rating":"3.0","score":3,"comparative":0.125,"effective":0.375,"wordLength":1},{"title":"Value of money","review":"Nice product","rating":"5.0","score":3,"comparative":0.2,"effective":1,"wordLength":1}] }